public class Main__textAnswers {
    /**
     *
     Задание 1. Ответьте письменно на вопросы:

     1)  Почему использование тестовых заглушек может быть полезным при написании модульных тестов?

     2) Какой тип тестовой заглушки следует использовать, если вам нужно проверить, что метод был вызван с определенными аргументами?

     3) Какой тип тестовой заглушки следует использовать,
     если вам просто нужно вернуть определенное значение или исключение в ответ на вызов метода?

     4) Какой тип тестовой заглушки вы бы использовали для имитации  взаимодействия с внешним API или базой данных?
     */


    // 1. Создается безопасный объект, который не влияет на основную программу.
    // В который можно добавить дополнительный функционал полезный для тестирования.

    // 2. mock

    // 3. stub

    // 4. mock
}
